posts/2015-10-04-gun-violence--a-prayer.org
#+date: <2015-10-04>
#+filetags: prayer religion
#+title: Gun Violence — A Prayer

Grieving for the lives lost in Oregon, a\\
prayer for World Communion Sunday, 2015:

Merciful God,

At least three while\\
we sit in worship,

Eighty today,\\
as we rest\\
on the Sabbath,

Thirty thousand lives\\
lost in a single year.

Some were taken\\
by their own hand,\\
some by accident,\\
still others by strangers.

All were lost in\\
brutal acts of violence,\\
sacrificed on the altar\\
of our rights.

Christ gave up everything\\
so that I might have life,\\
what am I willing to give up
so that others may live?

Lord, have mercy.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
