docs/posts/2015-10-04-gun-violence--a-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gun Violence — A Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Gun Violence — A Prayer</h1>
<p class="subtitle" role="doc-subtitle">Oct 04, 2015</p>
</header><p>
Grieving for the lives lost in Oregon, a<br>
prayer for World Communion Sunday, 2015:
</p>

<p>
Merciful God,
</p>

<p>
At least three while<br>
we sit in worship,
</p>

<p>
Eighty today,<br>
as we rest<br>
on the Sabbath,
</p>

<p>
Thirty thousand lives<br>
lost in a single year.
</p>

<p>
Some were taken<br>
by their own hand,<br>
some by accident,<br>
still others by strangers.
</p>

<p>
All were lost in<br>
brutal acts of violence,<br>
sacrificed on the altar<br>
of our rights.
</p>

<p>
Christ gave up everything<br>
so that I might have life,<br>
what am I willing to give up
so that others may live?
</p>

<p>
Lord, have mercy.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
